Задание 1
1.0/1.0 point (graded)
Напишите программу, которая ищет наибольший (не равный 1) общий делитель двух чисел, введённых пользователем (num_1, num_2), и выводит его на экран. Если общих делителей нет, выводит на экран "Общих делителей не найдено".

Для проверки используйте num_1 = 1812, num_2 = 2500

PS: Если использовать break в цикле for - else, то при прерывании цикла код после else выполняться не будет.

#num_1 = int(input())
#num_2 = int(input())
num_1 = 1812
num_2 = 2500
for c in range(1,num_2+1):
    if num_1%c==0 and num_2%c==0:
        maxim=c
if maxim>1:
    print(maxim)
else:
    print('Общих делителей не найдено')